Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment.SurfaceTypeEnum Enumeration
 The different surfacing types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SurfaceTypeEnum
Public Enumeration SurfaceTypeEnum
Members
Member name | Value | Description
CONCRETE_FINISH | 1 |  The concrete finish surface type.
SPECIAL_MIX | 2 |  The special mix surface type.
TILE_SURFACE | 3 |  The tile surface type.
STEEL_FINISH | 4 |  The steel finish surface type.
See Also
Reference
Tekla.Structures.Model Namespace